In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("Data-cleaning-for-beginners-using-pandas.csv")
print(data)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [3]:
df = data.copy()
print(df)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [4]:
df.describe()

           Index        Age     Rating  Established
count  29.000000  22.000000  28.000000    29.000000
mean   14.000000  39.045455   3.528571  1638.620690
std     8.514693  16.134781   2.825133   762.079599
min     0.000000  13.000000  -1.000000    -1.000000
25%     7.000000  25.000000   1.050000  1935.000000
50%    14.000000  39.500000   4.200000  1984.000000
75%    21.000000  50.000000   5.400000  1999.000000
max    28.000000  66.000000   7.800000  2020.000000

# 1. Missing Values:-

In [7]:
df.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [8]:
# filling missing values of Age column
aged = df['Age'].mode()[0]
df['Age'].fillna(aged,inplace = True)
df['Age'] = df['Age'].astype(int)

# filling missing values of Rating Column
df.Rating.fillna(df.Rating.mean(),inplace = True)
print(df)

    Index  Age      Salary    Rating       Location  Established Easy Apply
0       0   44   $44k-$99k  5.400000       India,In         1999       TRUE
1       1   66   $55k-$66k  3.500000    New York,Ny         2002       TRUE
2       2   44   $77k-$89k -1.000000    New York,Ny           -1         -1
3       3   64   $44k-$99k  4.400000       India In         1988         -1
4       4   25   $44k-$99k  6.400000  Australia Aus         2002         -1
5       5   44   $77k-$89k  1.400000       India,In         1999       TRUE
6       6   21   $44k-$99k  0.000000    New York,Ny           -1         -1
7       7   44   $44k-$99k -1.000000  Australia Aus           -1         -1
8       8   35   $44k-$99k  5.400000    New York,Ny           -1         -1
9       9   22   $44k-$99k  7.700000       India,In           -1       TRUE
10     10   55   $10k-$49k  5.400000       India,In         2008       TRUE
11     11   44   $10k-$49k  6.700000       India,In         2009         -1
12     12   44   $44k-$99k  0.000000       India,In         1999         -1
13     13   25   $44k-$99k -1.000000  Australia Aus         2019       TRUE
14     14   66   $44k-$99k  4.000000  Australia Aus         2020       TRUE
15     15   44  $88k-$101k  3.000000  Australia Aus         1999         -1
16     16   19   $19k-$40k  4.500000       India,In         1984         -1
17     17   44   $44k-$99k  5.300000    New York,Ny         1943       TRUE
18     18   35   $44k-$99k  6.700000    New York,Ny         1954       TRUE
19     19   32   $44k-$99k  3.300000    New York,Ny         1955       TRUE
20     20   44   $44k-$99k  5.700000    New York,Ny         1944       TRUE
21     21   35   $44k-$99k  5.000000    New York,Ny         1946         -1
22     22   19   $55k-$66k  7.800000    New York,Ny         1988       TRUE
23     23   44   $44k-$99k  2.400000    New York,Ny         1999       TRUE
24     24   13   $44k-$99k -1.000000    New York,Ny         1987         -1
25     25   55   $44k-$99k  0.000000  Australia Aus         1980       TRUE
26     26   44   $55k-$66k  3.528571       India,In         1934       TRUE
27     27   52   $44k-$99k  5.400000       India,In         1935         -1
28     28   44   $39k-$88k  3.400000  Australia Aus         1932         -1

# 2. Data Types:-

In [13]:
df.dtypes

Index            int64
Age              int32
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

# 3. Outliers:-

In [15]:
Outlier = ['Age','Rating']
for i in Outlier:
    Q1 = df[i].quantile(0.25)
    Q3 = df[i].quantile(0.75)
    IQR = Q3 - Q1
    
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    
    outliers = df[(df[i] < lower_bound) | (df[i] > upper_bound)]
    
    print(f"Potential Outliers in {i}: ")
    print(outliers)

Potential Outliers in Age:
    Index  Age     Salary  Rating       Location  Established Easy Apply
1       1   66  $55k-$66k     3.5    New York,Ny         2002       TRUE
3       3   64  $44k-$99k     4.4       India In         1988         -1
14     14   66  $44k-$99k     4.0  Australia Aus         2020       TRUE
24     24   13  $44k-$99k    -1.0    New York,Ny         1987         -1
Potential Outliers in Rating:
Empty DataFrame
Columns: [Index, Age, Salary, Rating, Location, Established, Easy Apply]
Index: []

# 4. Salary Formatting

In [18]:
df.Salary

0      $44k-$99k
1      $55k-$66k
2      $77k-$89k
3      $44k-$99k
4      $44k-$99k
5      $77k-$89k
6      $44k-$99k
7      $44k-$99k
8      $44k-$99k
9      $44k-$99k
10     $10k-$49k
11     $10k-$49k
12     $44k-$99k
13     $44k-$99k
14     $44k-$99k
15    $88k-$101k
16     $19k-$40k
17     $44k-$99k
18     $44k-$99k
19     $44k-$99k
20     $44k-$99k
21     $44k-$99k
22     $55k-$66k
23     $44k-$99k
24     $44k-$99k
25     $44k-$99k
26     $55k-$66k
27     $44k-$99k
28     $39k-$88k
Name: Salary, dtype: object

In [19]:
df['Salary'] = df.Salary.str.replace("$"," ")
df['Salary'] = df.Salary
print(df)

    Index  Age      Salary    Rating       Location  Established Easy Apply
0       0   44    44k- 99k  5.400000       India,In         1999       TRUE
1       1   66    55k- 66k  3.500000    New York,Ny         2002       TRUE
2       2   44    77k- 89k -1.000000    New York,Ny           -1         -1
3       3   64    44k- 99k  4.400000       India In         1988         -1
4       4   25    44k- 99k  6.400000  Australia Aus         2002         -1
5       5   44    77k- 89k  1.400000       India,In         1999       TRUE
6       6   21    44k- 99k  0.000000    New York,Ny           -1         -1
7       7   44    44k- 99k -1.000000  Australia Aus           -1         -1
8       8   35    44k- 99k  5.400000    New York,Ny           -1         -1
9       9   22    44k- 99k  7.700000       India,In           -1       TRUE
10     10   55    10k- 49k  5.400000       India,In         2008       TRUE
11     11   44    10k- 49k  6.700000       India,In         2009         -1
12     12   44    44k- 99k  0.000000       India,In         1999         -1
13     13   25    44k- 99k -1.000000  Australia Aus         2019       TRUE
14     14   66    44k- 99k  4.000000  Australia Aus         2020       TRUE
15     15   44   88k- 101k  3.000000  Australia Aus         1999         -1
16     16   19    19k- 40k  4.500000       India,In         1984         -1
17     17   44    44k- 99k  5.300000    New York,Ny         1943       TRUE
18     18   35    44k- 99k  6.700000    New York,Ny         1954       TRUE
19     19   32    44k- 99k  3.300000    New York,Ny         1955       TRUE
20     20   44    44k- 99k  5.700000    New York,Ny         1944       TRUE
21     21   35    44k- 99k  5.000000    New York,Ny         1946         -1
22     22   19    55k- 66k  7.800000    New York,Ny         1988       TRUE
23     23   44    44k- 99k  2.400000    New York,Ny         1999       TRUE
24     24   13    44k- 99k -1.000000    New York,Ny         1987         -1
25     25   55    44k- 99k  0.000000  Australia Aus         1980       TRUE
26     26   44    55k- 66k  3.528571       India,In         1934       TRUE
27     27   52    44k- 99k  5.400000       India,In         1935         -1
28     28   44    39k- 88k  3.400000  Australia Aus         1932         -1

C:\Users\Aman\AppData\Local\Temp\ipykernel_2184\3409052919.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Salary'] = df.Salary.str.replace("$"," ")

In [20]:
df['Salary'] = df.Salary.str.replace("k","000")
df['Salary'] = df.Salary
print(df)

    Index  Age          Salary    Rating       Location  Established  \
0       0   44    44000- 99000  5.400000       India,In         1999
1       1   66    55000- 66000  3.500000    New York,Ny         2002
2       2   44    77000- 89000 -1.000000    New York,Ny           -1
3       3   64    44000- 99000  4.400000       India In         1988
4       4   25    44000- 99000  6.400000  Australia Aus         2002
5       5   44    77000- 89000  1.400000       India,In         1999
6       6   21    44000- 99000  0.000000    New York,Ny           -1
7       7   44    44000- 99000 -1.000000  Australia Aus           -1
8       8   35    44000- 99000  5.400000    New York,Ny           -1
9       9   22    44000- 99000  7.700000       India,In           -1
10     10   55    10000- 49000  5.400000       India,In         2008
11     11   44    10000- 49000  6.700000       India,In         2009
12     12   44    44000- 99000  0.000000       India,In         1999
13     13   25    44000- 99000 -1.000000  Australia Aus         2019
14     14   66    44000- 99000  4.000000  Australia Aus         2020
15     15   44   88000- 101000  3.000000  Australia Aus         1999
16     16   19    19000- 40000  4.500000       India,In         1984
17     17   44    44000- 99000  5.300000    New York,Ny         1943
18     18   35    44000- 99000  6.700000    New York,Ny         1954
19     19   32    44000- 99000  3.300000    New York,Ny         1955
20     20   44    44000- 99000  5.700000    New York,Ny         1944
21     21   35    44000- 99000  5.000000    New York,Ny         1946
22     22   19    55000- 66000  7.800000    New York,Ny         1988
23     23   44    44000- 99000  2.400000    New York,Ny         1999
24     24   13    44000- 99000 -1.000000    New York,Ny         1987
25     25   55    44000- 99000  0.000000  Australia Aus         1980
26     26   44    55000- 66000  3.528571       India,In         1934
27     27   52    44000- 99000  5.400000       India,In         1935
28     28   44    39000- 88000  3.400000  Australia Aus         1932

   Easy Apply
0        TRUE
1        TRUE
2          -1
3          -1
4          -1
5        TRUE
6          -1
7          -1
8          -1
9        TRUE
10       TRUE
11         -1
12         -1
13       TRUE
14       TRUE
15         -1
16         -1
17       TRUE
18       TRUE
19       TRUE
20       TRUE
21         -1
22       TRUE
23       TRUE
24         -1
25       TRUE
26       TRUE
27         -1
28         -1

In [21]:
df.rename(columns={"Easy Apply":"Apply"},inplace=True)
print(df)

    Index  Age          Salary    Rating       Location  Established Apply
0       0   44    44000- 99000  5.400000       India,In         1999  TRUE
1       1   66    55000- 66000  3.500000    New York,Ny         2002  TRUE
2       2   44    77000- 89000 -1.000000    New York,Ny           -1    -1
3       3   64    44000- 99000  4.400000       India In         1988    -1
4       4   25    44000- 99000  6.400000  Australia Aus         2002    -1
5       5   44    77000- 89000  1.400000       India,In         1999  TRUE
6       6   21    44000- 99000  0.000000    New York,Ny           -1    -1
7       7   44    44000- 99000 -1.000000  Australia Aus           -1    -1
8       8   35    44000- 99000  5.400000    New York,Ny           -1    -1
9       9   22    44000- 99000  7.700000       India,In           -1  TRUE
10     10   55    10000- 49000  5.400000       India,In         2008  TRUE
11     11   44    10000- 49000  6.700000       India,In         2009    -1
12     12   44    44000- 99000  0.000000       India,In         1999    -1
13     13   25    44000- 99000 -1.000000  Australia Aus         2019  TRUE
14     14   66    44000- 99000  4.000000  Australia Aus         2020  TRUE
15     15   44   88000- 101000  3.000000  Australia Aus         1999    -1
16     16   19    19000- 40000  4.500000       India,In         1984    -1
17     17   44    44000- 99000  5.300000    New York,Ny         1943  TRUE
18     18   35    44000- 99000  6.700000    New York,Ny         1954  TRUE
19     19   32    44000- 99000  3.300000    New York,Ny         1955  TRUE
20     20   44    44000- 99000  5.700000    New York,Ny         1944  TRUE
21     21   35    44000- 99000  5.000000    New York,Ny         1946    -1
22     22   19    55000- 66000  7.800000    New York,Ny         1988  TRUE
23     23   44    44000- 99000  2.400000    New York,Ny         1999  TRUE
24     24   13    44000- 99000 -1.000000    New York,Ny         1987    -1
25     25   55    44000- 99000  0.000000  Australia Aus         1980  TRUE
26     26   44    55000- 66000  3.528571       India,In         1934  TRUE
27     27   52    44000- 99000  5.400000       India,In         1935    -1
28     28   44    39000- 88000  3.400000  Australia Aus         1932    -1

In [22]:
df['Salary'] = df.Salary.str.replace(" ","")
df['Salary'] = df.Salary
print(df)

    Index  Age        Salary    Rating       Location  Established Apply
0       0   44   44000-99000  5.400000       India,In         1999  TRUE
1       1   66   55000-66000  3.500000    New York,Ny         2002  TRUE
2       2   44   77000-89000 -1.000000    New York,Ny           -1    -1
3       3   64   44000-99000  4.400000       India In         1988    -1
4       4   25   44000-99000  6.400000  Australia Aus         2002    -1
5       5   44   77000-89000  1.400000       India,In         1999  TRUE
6       6   21   44000-99000  0.000000    New York,Ny           -1    -1
7       7   44   44000-99000 -1.000000  Australia Aus           -1    -1
8       8   35   44000-99000  5.400000    New York,Ny           -1    -1
9       9   22   44000-99000  7.700000       India,In           -1  TRUE
10     10   55   10000-49000  5.400000       India,In         2008  TRUE
11     11   44   10000-49000  6.700000       India,In         2009    -1
12     12   44   44000-99000  0.000000       India,In         1999    -1
13     13   25   44000-99000 -1.000000  Australia Aus         2019  TRUE
14     14   66   44000-99000  4.000000  Australia Aus         2020  TRUE
15     15   44  88000-101000  3.000000  Australia Aus         1999    -1
16     16   19   19000-40000  4.500000       India,In         1984    -1
17     17   44   44000-99000  5.300000    New York,Ny         1943  TRUE
18     18   35   44000-99000  6.700000    New York,Ny         1954  TRUE
19     19   32   44000-99000  3.300000    New York,Ny         1955  TRUE
20     20   44   44000-99000  5.700000    New York,Ny         1944  TRUE
21     21   35   44000-99000  5.000000    New York,Ny         1946    -1
22     22   19   55000-66000  7.800000    New York,Ny         1988  TRUE
23     23   44   44000-99000  2.400000    New York,Ny         1999  TRUE
24     24   13   44000-99000 -1.000000    New York,Ny         1987    -1
25     25   55   44000-99000  0.000000  Australia Aus         1980  TRUE
26     26   44   55000-66000  3.528571       India,In         1934  TRUE
27     27   52   44000-99000  5.400000       India,In         1935    -1
28     28   44   39000-88000  3.400000  Australia Aus         1932    -1

# 5. Location Standardization:-

In [24]:
df['Location'] = df.Location.replace('Australia Aus','Australia,Aus')
print(df)

    Index  Age        Salary    Rating       Location  Established Apply
0       0   44   44000-99000  5.400000       India,In         1999  TRUE
1       1   66   55000-66000  3.500000    New York,Ny         2002  TRUE
2       2   44   77000-89000 -1.000000    New York,Ny           -1    -1
3       3   64   44000-99000  4.400000       India In         1988    -1
4       4   25   44000-99000  6.400000  Australia,Aus         2002    -1
5       5   44   77000-89000  1.400000       India,In         1999  TRUE
6       6   21   44000-99000  0.000000    New York,Ny           -1    -1
7       7   44   44000-99000 -1.000000  Australia,Aus           -1    -1
8       8   35   44000-99000  5.400000    New York,Ny           -1    -1
9       9   22   44000-99000  7.700000       India,In           -1  TRUE
10     10   55   10000-49000  5.400000       India,In         2008  TRUE
11     11   44   10000-49000  6.700000       India,In         2009    -1
12     12   44   44000-99000  0.000000       India,In         1999    -1
13     13   25   44000-99000 -1.000000  Australia,Aus         2019  TRUE
14     14   66   44000-99000  4.000000  Australia,Aus         2020  TRUE
15     15   44  88000-101000  3.000000  Australia,Aus         1999    -1
16     16   19   19000-40000  4.500000       India,In         1984    -1
17     17   44   44000-99000  5.300000    New York,Ny         1943  TRUE
18     18   35   44000-99000  6.700000    New York,Ny         1954  TRUE
19     19   32   44000-99000  3.300000    New York,Ny         1955  TRUE
20     20   44   44000-99000  5.700000    New York,Ny         1944  TRUE
21     21   35   44000-99000  5.000000    New York,Ny         1946    -1
22     22   19   55000-66000  7.800000    New York,Ny         1988  TRUE
23     23   44   44000-99000  2.400000    New York,Ny         1999  TRUE
24     24   13   44000-99000 -1.000000    New York,Ny         1987    -1
25     25   55   44000-99000  0.000000  Australia,Aus         1980  TRUE
26     26   44   55000-66000  3.528571       India,In         1934  TRUE
27     27   52   44000-99000  5.400000       India,In         1935    -1
28     28   44   39000-88000  3.400000  Australia,Aus         1932    -1

# 6. Established Column:-

In [26]:
df['Established'] = df['Established'].replace(-1,np.nan)
print(df)

    Index  Age        Salary    Rating       Location  Established Apply
0       0   44   44000-99000  5.400000       India,In       1999.0  TRUE
1       1   66   55000-66000  3.500000    New York,Ny       2002.0  TRUE
2       2   44   77000-89000 -1.000000    New York,Ny          NaN    -1
3       3   64   44000-99000  4.400000       India In       1988.0    -1
4       4   25   44000-99000  6.400000  Australia,Aus       2002.0    -1
5       5   44   77000-89000  1.400000       India,In       1999.0  TRUE
6       6   21   44000-99000  0.000000    New York,Ny          NaN    -1
7       7   44   44000-99000 -1.000000  Australia,Aus          NaN    -1
8       8   35   44000-99000  5.400000    New York,Ny          NaN    -1
9       9   22   44000-99000  7.700000       India,In          NaN  TRUE
10     10   55   10000-49000  5.400000       India,In       2008.0  TRUE
11     11   44   10000-49000  6.700000       India,In       2009.0    -1
12     12   44   44000-99000  0.000000       India,In       1999.0    -1
13     13   25   44000-99000 -1.000000  Australia,Aus       2019.0  TRUE
14     14   66   44000-99000  4.000000  Australia,Aus       2020.0  TRUE
15     15   44  88000-101000  3.000000  Australia,Aus       1999.0    -1
16     16   19   19000-40000  4.500000       India,In       1984.0    -1
17     17   44   44000-99000  5.300000    New York,Ny       1943.0  TRUE
18     18   35   44000-99000  6.700000    New York,Ny       1954.0  TRUE
19     19   32   44000-99000  3.300000    New York,Ny       1955.0  TRUE
20     20   44   44000-99000  5.700000    New York,Ny       1944.0  TRUE
21     21   35   44000-99000  5.000000    New York,Ny       1946.0    -1
22     22   19   55000-66000  7.800000    New York,Ny       1988.0  TRUE
23     23   44   44000-99000  2.400000    New York,Ny       1999.0  TRUE
24     24   13   44000-99000 -1.000000    New York,Ny       1987.0    -1
25     25   55   44000-99000  0.000000  Australia,Aus       1980.0  TRUE
26     26   44   55000-66000  3.528571       India,In       1934.0  TRUE
27     27   52   44000-99000  5.400000       India,In       1935.0    -1
28     28   44   39000-88000  3.400000  Australia,Aus       1932.0    -1

In [33]:
df['Established'] = df['Established'].replace(np.nan,df['Established'].mode()[0])
df['Established'] = df['Established'].astype(int)
print(df)

    Index  Age        Salary    Rating       Location  Established Apply
0       0   44   44000-99000  5.400000       India,In         1999  TRUE
1       1   66   55000-66000  3.500000    New York,Ny         2002  TRUE
2       2   44   77000-89000 -1.000000    New York,Ny         1999    -1
3       3   64   44000-99000  4.400000       India In         1988    -1
4       4   25   44000-99000  6.400000  Australia,Aus         2002    -1
5       5   44   77000-89000  1.400000       India,In         1999  TRUE
6       6   21   44000-99000  0.000000    New York,Ny         1999    -1
7       7   44   44000-99000 -1.000000  Australia,Aus         1999    -1
8       8   35   44000-99000  5.400000    New York,Ny         1999    -1
9       9   22   44000-99000  7.700000       India,In         1999  TRUE
10     10   55   10000-49000  5.400000       India,In         2008  TRUE
11     11   44   10000-49000  6.700000       India,In         2009    -1
12     12   44   44000-99000  0.000000       India,In         1999    -1
13     13   25   44000-99000 -1.000000  Australia,Aus         2019  TRUE
14     14   66   44000-99000  4.000000  Australia,Aus         2020  TRUE
15     15   44  88000-101000  3.000000  Australia,Aus         1999    -1
16     16   19   19000-40000  4.500000       India,In         1984    -1
17     17   44   44000-99000  5.300000    New York,Ny         1943  TRUE
18     18   35   44000-99000  6.700000    New York,Ny         1954  TRUE
19     19   32   44000-99000  3.300000    New York,Ny         1955  TRUE
20     20   44   44000-99000  5.700000    New York,Ny         1944  TRUE
21     21   35   44000-99000  5.000000    New York,Ny         1946    -1
22     22   19   55000-66000  7.800000    New York,Ny         1988  TRUE
23     23   44   44000-99000  2.400000    New York,Ny         1999  TRUE
24     24   13   44000-99000 -1.000000    New York,Ny         1987    -1
25     25   55   44000-99000  0.000000  Australia,Aus         1980  TRUE
26     26   44   55000-66000  3.528571       India,In         1934  TRUE
27     27   52   44000-99000  5.400000       India,In         1935    -1
28     28   44   39000-88000  3.400000  Australia,Aus         1932    -1

# 7. Easy Apply / Apply Indicator:-

In [38]:
df['Apply'] = df['Apply'].replace('-1',"FALSE")
print(df)

    Index  Age        Salary    Rating       Location  Established  Apply
0       0   44   44000-99000  5.400000       India,In         1999   TRUE
1       1   66   55000-66000  3.500000    New York,Ny         2002   TRUE
2       2   44   77000-89000 -1.000000    New York,Ny         1999  FALSE
3       3   64   44000-99000  4.400000       India In         1988  FALSE
4       4   25   44000-99000  6.400000  Australia,Aus         2002  FALSE
5       5   44   77000-89000  1.400000       India,In         1999   TRUE
6       6   21   44000-99000  0.000000    New York,Ny         1999  FALSE
7       7   44   44000-99000 -1.000000  Australia,Aus         1999  FALSE
8       8   35   44000-99000  5.400000    New York,Ny         1999  FALSE
9       9   22   44000-99000  7.700000       India,In         1999   TRUE
10     10   55   10000-49000  5.400000       India,In         2008   TRUE
11     11   44   10000-49000  6.700000       India,In         2009  FALSE
12     12   44   44000-99000  0.000000       India,In         1999  FALSE
13     13   25   44000-99000 -1.000000  Australia,Aus         2019   TRUE
14     14   66   44000-99000  4.000000  Australia,Aus         2020   TRUE
15     15   44  88000-101000  3.000000  Australia,Aus         1999  FALSE
16     16   19   19000-40000  4.500000       India,In         1984  FALSE
17     17   44   44000-99000  5.300000    New York,Ny         1943   TRUE
18     18   35   44000-99000  6.700000    New York,Ny         1954   TRUE
19     19   32   44000-99000  3.300000    New York,Ny         1955   TRUE
20     20   44   44000-99000  5.700000    New York,Ny         1944   TRUE
21     21   35   44000-99000  5.000000    New York,Ny         1946  FALSE
22     22   19   55000-66000  7.800000    New York,Ny         1988   TRUE
23     23   44   44000-99000  2.400000    New York,Ny         1999   TRUE
24     24   13   44000-99000 -1.000000    New York,Ny         1987  FALSE
25     25   55   44000-99000  0.000000  Australia,Aus         1980   TRUE
26     26   44   55000-66000  3.528571       India,In         1934   TRUE
27     27   52   44000-99000  5.400000       India,In         1935  FALSE
28     28   44   39000-88000  3.400000  Australia,Aus         1932  FALSE

# 8. Rating Range:-

In [41]:
df['Rating'] = df.Rating.round(decimals = 1).abs()
print(df)

    Index  Age        Salary  Rating       Location  Established  Apply
0       0   44   44000-99000     5.4       India,In         1999   TRUE
1       1   66   55000-66000     3.5    New York,Ny         2002   TRUE
2       2   44   77000-89000     1.0    New York,Ny         1999  FALSE
3       3   64   44000-99000     4.4       India In         1988  FALSE
4       4   25   44000-99000     6.4  Australia,Aus         2002  FALSE
5       5   44   77000-89000     1.4       India,In         1999   TRUE
6       6   21   44000-99000     0.0    New York,Ny         1999  FALSE
7       7   44   44000-99000     1.0  Australia,Aus         1999  FALSE
8       8   35   44000-99000     5.4    New York,Ny         1999  FALSE
9       9   22   44000-99000     7.7       India,In         1999   TRUE
10     10   55   10000-49000     5.4       India,In         2008   TRUE
11     11   44   10000-49000     6.7       India,In         2009  FALSE
12     12   44   44000-99000     0.0       India,In         1999  FALSE
13     13   25   44000-99000     1.0  Australia,Aus         2019   TRUE
14     14   66   44000-99000     4.0  Australia,Aus         2020   TRUE
15     15   44  88000-101000     3.0  Australia,Aus         1999  FALSE
16     16   19   19000-40000     4.5       India,In         1984  FALSE
17     17   44   44000-99000     5.3    New York,Ny         1943   TRUE
18     18   35   44000-99000     6.7    New York,Ny         1954   TRUE
19     19   32   44000-99000     3.3    New York,Ny         1955   TRUE
20     20   44   44000-99000     5.7    New York,Ny         1944   TRUE
21     21   35   44000-99000     5.0    New York,Ny         1946  FALSE
22     22   19   55000-66000     7.8    New York,Ny         1988   TRUE
23     23   44   44000-99000     2.4    New York,Ny         1999   TRUE
24     24   13   44000-99000     1.0    New York,Ny         1987  FALSE
25     25   55   44000-99000     0.0  Australia,Aus         1980   TRUE
26     26   44   55000-66000     3.5       India,In         1934   TRUE
27     27   52   44000-99000     5.4       India,In         1935  FALSE
28     28   44   39000-88000     3.4  Australia,Aus         1932  FALSE

# 9. Age Distribution:-

In [42]:
df.Age

0     44
1     66
2     44
3     64
4     25
5     44
6     21
7     44
8     35
9     22
10    55
11    44
12    44
13    25
14    66
15    44
16    19
17    44
18    35
19    32
20    44
21    35
22    19
23    44
24    13
25    55
26    44
27    52
28    44
Name: Age, dtype: int32

There are no unusual entries in the Age Column.

# 10. Handling Special Characters:-

In [43]:
print(df)

    Index  Age        Salary  Rating       Location  Established  Apply
0       0   44   44000-99000     5.4       India,In         1999   TRUE
1       1   66   55000-66000     3.5    New York,Ny         2002   TRUE
2       2   44   77000-89000     1.0    New York,Ny         1999  FALSE
3       3   64   44000-99000     4.4       India In         1988  FALSE
4       4   25   44000-99000     6.4  Australia,Aus         2002  FALSE
5       5   44   77000-89000     1.4       India,In         1999   TRUE
6       6   21   44000-99000     0.0    New York,Ny         1999  FALSE
7       7   44   44000-99000     1.0  Australia,Aus         1999  FALSE
8       8   35   44000-99000     5.4    New York,Ny         1999  FALSE
9       9   22   44000-99000     7.7       India,In         1999   TRUE
10     10   55   10000-49000     5.4       India,In         2008   TRUE
11     11   44   10000-49000     6.7       India,In         2009  FALSE
12     12   44   44000-99000     0.0       India,In         1999  FALSE
13     13   25   44000-99000     1.0  Australia,Aus         2019   TRUE
14     14   66   44000-99000     4.0  Australia,Aus         2020   TRUE
15     15   44  88000-101000     3.0  Australia,Aus         1999  FALSE
16     16   19   19000-40000     4.5       India,In         1984  FALSE
17     17   44   44000-99000     5.3    New York,Ny         1943   TRUE
18     18   35   44000-99000     6.7    New York,Ny         1954   TRUE
19     19   32   44000-99000     3.3    New York,Ny         1955   TRUE
20     20   44   44000-99000     5.7    New York,Ny         1944   TRUE
21     21   35   44000-99000     5.0    New York,Ny         1946  FALSE
22     22   19   55000-66000     7.8    New York,Ny         1988   TRUE
23     23   44   44000-99000     2.4    New York,Ny         1999   TRUE
24     24   13   44000-99000     1.0    New York,Ny         1987  FALSE
25     25   55   44000-99000     0.0  Australia,Aus         1980   TRUE
26     26   44   55000-66000     3.5       India,In         1934   TRUE
27     27   52   44000-99000     5.4       India,In         1935  FALSE
28     28   44   39000-88000     3.4  Australia,Aus         1932  FALSE

There is no special character to handle.

# 11. Data Integrity:-

All data is formatted in a meaningful format, removing missing values and also replacing wrong values with correct values.

In [44]:
print(df)

    Index  Age        Salary  Rating       Location  Established  Apply
0       0   44   44000-99000     5.4       India,In         1999   TRUE
1       1   66   55000-66000     3.5    New York,Ny         2002   TRUE
2       2   44   77000-89000     1.0    New York,Ny         1999  FALSE
3       3   64   44000-99000     4.4       India In         1988  FALSE
4       4   25   44000-99000     6.4  Australia,Aus         2002  FALSE
5       5   44   77000-89000     1.4       India,In         1999   TRUE
6       6   21   44000-99000     0.0    New York,Ny         1999  FALSE
7       7   44   44000-99000     1.0  Australia,Aus         1999  FALSE
8       8   35   44000-99000     5.4    New York,Ny         1999  FALSE
9       9   22   44000-99000     7.7       India,In         1999   TRUE
10     10   55   10000-49000     5.4       India,In         2008   TRUE
11     11   44   10000-49000     6.7       India,In         2009  FALSE
12     12   44   44000-99000     0.0       India,In         1999  FALSE
13     13   25   44000-99000     1.0  Australia,Aus         2019   TRUE
14     14   66   44000-99000     4.0  Australia,Aus         2020   TRUE
15     15   44  88000-101000     3.0  Australia,Aus         1999  FALSE
16     16   19   19000-40000     4.5       India,In         1984  FALSE
17     17   44   44000-99000     5.3    New York,Ny         1943   TRUE
18     18   35   44000-99000     6.7    New York,Ny         1954   TRUE
19     19   32   44000-99000     3.3    New York,Ny         1955   TRUE
20     20   44   44000-99000     5.7    New York,Ny         1944   TRUE
21     21   35   44000-99000     5.0    New York,Ny         1946  FALSE
22     22   19   55000-66000     7.8    New York,Ny         1988   TRUE
23     23   44   44000-99000     2.4    New York,Ny         1999   TRUE
24     24   13   44000-99000     1.0    New York,Ny         1987  FALSE
25     25   55   44000-99000     0.0  Australia,Aus         1980   TRUE
26     26   44   55000-66000     3.5       India,In         1934   TRUE
27     27   52   44000-99000     5.4       India,In         1935  FALSE
28     28   44   39000-88000     3.4  Australia,Aus         1932  FALSE

# 12. Easy Apply Transformation:-

In [53]:
df.Apply

0      TRUE
1      TRUE
2     FALSE
3     FALSE
4     FALSE
5      TRUE
6     FALSE
7     FALSE
8     FALSE
9      TRUE
10     TRUE
11    FALSE
12    FALSE
13     TRUE
14     TRUE
15    FALSE
16    FALSE
17     TRUE
18     TRUE
19     TRUE
20     TRUE
21    FALSE
22     TRUE
23     TRUE
24    FALSE
25     TRUE
26     TRUE
27    FALSE
28    FALSE
Name: Apply, dtype: object

All the non-boolien values are transformed in usuable format.

# 13. Location Accuracy:-

There are no misspelled or ambiguous locations that require correction, if there was it has already been corrected.

In [49]:
df.Location

0          India,In
1       New York,Ny
2       New York,Ny
3          India In
4     Australia,Aus
5          India,In
6       New York,Ny
7     Australia,Aus
8       New York,Ny
9          India,In
10         India,In
11         India,In
12         India,In
13    Australia,Aus
14    Australia,Aus
15    Australia,Aus
16         India,In
17      New York,Ny
18      New York,Ny
19      New York,Ny
20      New York,Ny
21      New York,Ny
22      New York,Ny
23      New York,Ny
24      New York,Ny
25    Australia,Aus
26         India,In
27         India,In
28    Australia,Aus
Name: Location, dtype: object

# 14. Handling Categorical Data:-

Columns(For eg. Established, Easy Apply) that have ambiguity in their values are handled with a corrected format for better analysis.

In [50]:
df

    Index  Age        Salary  Rating       Location  Established  Apply
0       0   44   44000-99000     5.4       India,In         1999   TRUE
1       1   66   55000-66000     3.5    New York,Ny         2002   TRUE
2       2   44   77000-89000     1.0    New York,Ny         1999  FALSE
3       3   64   44000-99000     4.4       India In         1988  FALSE
4       4   25   44000-99000     6.4  Australia,Aus         2002  FALSE
5       5   44   77000-89000     1.4       India,In         1999   TRUE
6       6   21   44000-99000     0.0    New York,Ny         1999  FALSE
7       7   44   44000-99000     1.0  Australia,Aus         1999  FALSE
8       8   35   44000-99000     5.4    New York,Ny         1999  FALSE
9       9   22   44000-99000     7.7       India,In         1999   TRUE
10     10   55   10000-49000     5.4       India,In         2008   TRUE
11     11   44   10000-49000     6.7       India,In         2009  FALSE
12     12   44   44000-99000     0.0       India,In         1999  FALSE
13     13   25   44000-99000     1.0  Australia,Aus         2019   TRUE
14     14   66   44000-99000     4.0  Australia,Aus         2020   TRUE
15     15   44  88000-101000     3.0  Australia,Aus         1999  FALSE
16     16   19   19000-40000     4.5       India,In         1984  FALSE
17     17   44   44000-99000     5.3    New York,Ny         1943   TRUE
18     18   35   44000-99000     6.7    New York,Ny         1954   TRUE
19     19   32   44000-99000     3.3    New York,Ny         1955   TRUE
20     20   44   44000-99000     5.7    New York,Ny         1944   TRUE
21     21   35   44000-99000     5.0    New York,Ny         1946  FALSE
22     22   19   55000-66000     7.8    New York,Ny         1988   TRUE
23     23   44   44000-99000     2.4    New York,Ny         1999   TRUE
24     24   13   44000-99000     1.0    New York,Ny         1987  FALSE
25     25   55   44000-99000     0.0  Australia,Aus         1980   TRUE
26     26   44   55000-66000     3.5       India,In         1934   TRUE
27     27   52   44000-99000     5.4       India,In         1935  FALSE
28     28   44   39000-88000     3.4  Australia,Aus         1932  FALSE

# 15. Consistent Rating Scale:-

In [52]:
df.Rating

0     5.4
1     3.5
2     1.0
3     4.4
4     6.4
5     1.4
6     0.0
7     1.0
8     5.4
9     7.7
10    5.4
11    6.7
12    0.0
13    1.0
14    4.0
15    3.0
16    4.5
17    5.3
18    6.7
19    3.3
20    5.7
21    5.0
22    7.8
23    2.4
24    1.0
25    0.0
26    3.5
27    5.4
28    3.4
Name: Rating, dtype: float64

In [5]:
df.to_csv('Cleaned_Dataset_1.csv')